app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test Prep"], ["room_number", 5], ["created_at", "2021-03-11 14:07:14.491213"], ["updated_at", "2021-03-11 14:07:14.491213"]]
---
  def create
    @school_class = SchoolClass.create(strong_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Test"], ["updated_at", "2021-03-11 14:28:28.433356"], ["id", 6]]
---
  def update
    @school_class = SchoolClass.find_by(id: params[:id])
    @school_class.update(strong_params(:title, :room_number))