app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "New"], ["last_name", "Student"], ["created_at", "2021-03-11 13:58:15.952037"], ["updated_at", "2021-03-11 13:58:15.952037"]]
---
  def create
    @student = Student.create(strong_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Nice"], ["updated_at", "2021-03-11 14:19:53.766602"], ["id", 6]]
---
  def update
    @student = Student.find_by(id: params[:id])
    @student.update(strong_params(:first_name, :last_name))